package cn.zswltech.mithras.customer.enums;

/**
 * @author junke
 */
public enum CalcBizSubjectEnum {

    /*
    A9001	资产负债率	=资产负债表中的 负债合计/资产合计	=G9152/G9130
    A9002	流动比率	=资产负债表中的 流动资产合计/流动负债合计	G9111/G9143
    A9003	速动比率	=资产负债表中的 （流动资产合计-预付账款-存货-一年内到期的非流动资产）/流动负债合计	(G9111-G9104-G9108-G9109)/G9143
    A9004	应收账款周转天数	=(资产负债表的 本期 应收账款+上期 应收账款)/2/利润表的 营业收入*360	G9103的(本年+上年)/2/H9170*360
    A9005	存货周转天数	=(资产负债表的 本期 存货+上期 存货)/2/利润表的 营业成本*360	G9108的(本年+上年)/2/H9171*360
    A9005	存货周转天数	=(资产负债表的 本期 存货+上期 存货)/2/利润表的 营业成本*360	G9108的(本年+上年)/2/H9171*360
     A9006	总资产周转率	=利润表的 营业收入/((资产负债表的 本期 资产合计+上期 资产合计)/2)	H9170/【G9130的(本年+上年)/2】
     A9007	财务费用/营业收入	=利润表的 财务费用/营业收入	H9175/H9170
     A9008	销售费用/营业收入	=利润表的 销售费用/营业收入	H9173/H9170
     A9009	管理费用/营业收入	=利润表的 管理费用/营业收入	H9174/H9170
     A9010	总资产报酬率	=利润表的 净利润 /((资产负债表的 本期 资产合计+上期 资产合计）/2）	H9186/【G9130的(本年+上年)/2】
     A9011	净资产收益率	=利润表的 净利润/((资产负债表的 本期 所有者权益合计+上期 所有者权益合计)/2)	H9186/【G9158的(本年+上年)/2】
     A9012	销售（营业）增长率	=利润表的 本期 营业收入/上期 营业收入 -1	H9170的 本年/上年-1
     A9013	总资产增长率	=资产负债表的 本期 资产合计/上期 资产合计 -1	G9130的 本年/上年-1
     A9014	固定资产增长率	=资产负债表的 本期 固定资产/上期 固定资产 -1	G9117的 本年/上年-1
     A9015	资本积累率	=资产负债表的 本期 所有者权益合计/上期 所有者权益合计 -1	G9158的 本年/上年-1
     A9016	总负债增长率	=资产负债表的 本期 负债合计/上期 负债合计 -1	G9152的 本年/上年-1
     A9017	毛利率	=(利润表的 营业收入-营业成本)/营业收入	1-H9171/H9170
     A9018	利息保障倍数	=利润表的 营业利润/ 利息支出	H9180/H0001
     A9019	净利润率	=利润表的 净利润/营业收入	H9186/H9170
     A9020	EBITDA利息保障倍数	=(利润表的 营业利润+利息支出 +资产负债表的 本期 累计折旧 - 上期 累计折旧)/利润表的 利息支出	H9180+H0001+G0001的 （本年-去年）/ H0001
     A9021	长期有息债务	=资产负债表的 长期借款+应付债券+长期应付款	G9144+G9145+G9146
     A9022	短期有息债务	=资产负债表的 短期借款+应付票据+一年内到期的非流动负债	G9131+G9133+G9141
     A9023	有息债务合计	=长期有息债务+短期有息债务	A9021+A9022
 */
    A9023("${A9021+A9022}", "有息债务合计"),

    A9022("${G9131+G9133+G9141}", "短期有息债务"),

    A9021("${G9144+G9145+G9146}", "长期有息债务"),

    A9020("${H9180+H0001+G0001-last_H9180-last_H0001-last_G0001）/ H0001}", "EBITDA利息保障倍数"),

    A9019("${H9186/H9170}", "净利润率"),

    A9018("${H9180/H0001}", "利息保障倍数"),

    A9017("${1-H9171/H9170}", "毛利率"),

    A9016("${G9152/last_G9152-1}", "总负债增长率"),

    A9015("${G9158/last_G9158-1}", "资本积累率"),

    A9014("${G9117/last_G9117-1}", "固定资产增长率"),

    A9013("${G9130/G9130-1}", "总资产增长率"),

    A9012("${H9170/last_H9170-1}", "销售（营业）增长率"),

    A9011("${H9186/((G9158+last_G9158)/2)}", "净资产收益率"),

    A9010("${H9186/((G9130+last_G9130)/2)}", "总资产报酬率"),

    A9009("${H9174/H9170}", "管理费用/营业收入"),

    A9008("${H9173/H9170}", "销售费用/营业收入"),

    A9007("${H9175/H9170}", "财务费用/营业收入"),
    A9006("${H9170/((G9130+last_G9130)/2)}", "总资产周转率"),
    A9005("${(G9108+last_G9108)/2/H9171*360}", "存货周转天数"),
    A9004("${(G9103+last_G9103)/2/H9170*360}", "应收账款周转天数"),
    A9003("${(G9111-G9104-G9108-G9109)/G9143}", "速动比率"),
    A9002("${G9111/G9143}", "流动比率"),
    A9001("${G9152/G9130}", "资产负债率");

    CalcBizSubjectEnum(String exp, String desc) {
        this.exp = exp;
        this.desc = desc;
    }

    public final String exp;
    public final String desc;


}
