package cn.zswltech.mithras.others.数据导出;

import cn.hutool.core.collection.ListUtil;
import cn.hutool.core.lang.TypeReference;
import cn.hutool.core.util.NumberUtil;
import cn.hutool.core.util.StrUtil;
import cn.hutool.json.JSONUtil;
import cn.hutool.poi.excel.ExcelUtil;
import cn.hutool.poi.excel.ExcelWriter;
import cn.zswltech.mithras.foundation.constant.GlobalConstants;
import cn.zswltech.mithras.foundation.enums.CashFlowItemEnum;
import cn.zswltech.mithras.fund.directfinancing.persistence.model.FundDirectFinancingBaseInfo;
import cn.zswltech.mithras.fund.directfinancing.persistence.model.FundDirectFinancingPledgeInfo;
import cn.zswltech.mithras.application.orchestration.fund.direct.service.FundDirectFinancingBaseInfoService;
import cn.zswltech.mithras.application.orchestration.fund.direct.service.FundDirectFinancingPledgeInfoService;
import cn.zswltech.mithras.collection.model.CollectionBaseInfo;
import cn.zswltech.mithras.contract.model.contract.ContractBaseInfo;
import cn.zswltech.mithras.fund.persistence.model.financing.FundFinancingBaseInfo;
import cn.zswltech.mithras.fund.persistence.model.financing.FundFinancingPledgeInfo;
import cn.zswltech.mithras.fund.persistence.model.receiptrepay.FundReceiptRepayBaseInfo;
import cn.zswltech.mithras.fund.persistence.model.receiptrepay.FundReceiptRepayCashFlow;
import cn.zswltech.mithras.collection.application.CollectionBaseInfoService;
import cn.zswltech.mithras.contract.core.application.ContractBaseInfoService;
import cn.zswltech.mithras.fund.application.financing.FundFinancingBaseInfoService;
import cn.zswltech.mithras.fund.application.financing.FundFinancingPledgeInfoService;
import cn.zswltech.mithras.fund.application.receiptrepay.FundReceiptRepayBaseInfoService;
import cn.zswltech.mithras.fund.application.receiptrepay.FundReceiptRepayCashFlowService;
import cn.zswltech.mithras.web.MithrasApplication;
import com.baomidou.mybatisplus.core.toolkit.Wrappers;
import lombok.Data;
import lombok.experimental.Accessors;
import lombok.extern.slf4j.Slf4j;
import org.apache.poi.hssf.usermodel.HSSFClientAnchor;
import org.apache.poi.hssf.usermodel.HSSFRichTextString;
import org.apache.poi.ss.usermodel.*;
import org.apache.poi.xssf.usermodel.XSSFClientAnchor;
import org.apache.poi.xssf.usermodel.XSSFRichTextString;
import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.ActiveProfiles;

import java.math.BigDecimal;
import java.math.RoundingMode;
import java.nio.file.Paths;
import java.time.LocalDate;
import java.time.temporal.TemporalAdjusters;
import java.util.*;
import java.util.stream.Collectors;

import static cn.hutool.extra.spring.SpringUtil.getBean;
import static java.lang.Double.parseDouble;

/**
 * @author luyi
 */
@Slf4j
@ActiveProfiles("pre")
@SpringBootTest(classes = MithrasApplication.class, webEnvironment = SpringBootTest.WebEnvironment.RANDOM_PORT)
public class 资金流动性统计表 {

    static LocalDate monthStart = LocalDate.of(2023, 9, 1);
    static LocalDate monthEnd = monthStart.with(TemporalAdjusters.lastDayOfMonth());

    @Test
    public void test() {
        List<Record> result = new ArrayList<>();
        //某月份的所有融资现金流
        List<FundReceiptRepayCashFlow> cashFlowList = getBean(FundReceiptRepayCashFlowService.class).list(
                Wrappers.<FundReceiptRepayCashFlow>lambdaQuery()
                        .ge(FundReceiptRepayCashFlow::getRepayDate, monthStart)
                        .le(FundReceiptRepayCashFlow::getRepayDate, monthEnd));
        //
        for (FundReceiptRepayCashFlow cashFlow : cashFlowList) {
            try {
                Record record = new Record();
                FundReceiptRepayBaseInfo fundReceiptInfo = getFundReceiptInfo(cashFlow.getReceiptRepayId());
                String financingType = fundReceiptInfo.getFinancingType();
                if ("DIRECT".equals(financingType)) {//直融
                    FundDirectFinancingBaseInfo info = getBean(FundDirectFinancingBaseInfoService.class).getById(cashFlow.getFinancingId());
                    record.set融资渠道("直租-" + info.getProductName());
                    record.set融资编码(info.getFinancingCode());
                    record.set融资金额(toWanYuan(info.getFinancingAmount()));

                } else {
                    FundFinancingBaseInfo info = getFundFinancingInfo(cashFlow.getFinancingId());
//                    record.set融资渠道(info.getOrganizationNames());
                    record.set融资编码(info.getFinancingCode());
                    record.set融资金额(toWanYuan(info.getFinancingAmount()));
                }


                //--资金端
                record.set现金流出金额(toWanYuan(cashFlow.getRepayAmount()));
                record.set现金流出时间(cashFlow.getRepayDate());
                //--资产端
                List<Long> pledgeContractIdList = new ArrayList<>();
                if ("DIRECT".equals(financingType)) {//直融
                    List<FundDirectFinancingPledgeInfo> list = getBean(FundDirectFinancingPledgeInfoService.class)
                            .list(Wrappers.<FundDirectFinancingPledgeInfo>lambdaQuery()
                                    .eq(FundDirectFinancingPledgeInfo::getFinancingId, cashFlow.getFinancingId()));
                    pledgeContractIdList = list.stream().map(FundDirectFinancingPledgeInfo::getContractId).collect(Collectors.toList());
                } else {
                    List<FundFinancingPledgeInfo> pledgeInfoList = getBean(FundFinancingPledgeInfoService.class)
                            .list(Wrappers.<FundFinancingPledgeInfo>lambdaQuery()
                                    .eq(FundFinancingPledgeInfo::getFinancingId, cashFlow.getFinancingId()));
                    pledgeContractIdList = pledgeInfoList.stream().map(FundFinancingPledgeInfo::getContractId).collect(Collectors.toList());
                }

                List<InRecord> inRecords = new ArrayList<>();
                for (Long contractId : pledgeContractIdList) {
                    try {
                        ContractBaseInfo contractBaseInfo = getContractBaseInfo(contractId);
                        List<CollectionBaseInfo> collectionBaseInfoList = getBean(CollectionBaseInfoService.class).list(Wrappers.<CollectionBaseInfo>lambdaQuery()
                                .eq(CollectionBaseInfo::getContractId, contractId)
                                .ge(CollectionBaseInfo::getPlanCollectionDate, monthStart)
                                .le(CollectionBaseInfo::getPlanCollectionDate, monthEnd)
                                .eq(CollectionBaseInfo::getCashFlowItem, CashFlowItemEnum.RENT.name())
                        );
                        for (CollectionBaseInfo collectionBaseInfo : collectionBaseInfoList) {
                            InRecord inRecord = new InRecord();
                            inRecord.set合同编号(contractBaseInfo.getContractCode());
                            inRecord.set项目名称(contractBaseInfo.getProjName());
                            inRecord.set合同总金额(toWanYuan(contractBaseInfo.getApplyCreditAmount()));
                            inRecord.set现金流入时间(collectionBaseInfo.getPlanCollectionDate());
                            inRecord.set现金流入金额(toWanYuan(collectionBaseInfo.getPlanCollectionAmount()));
                            inRecords.add(inRecord);
                        }
                    } catch (Exception ee) {
                        log.error("", ee);
                    }
                }
                record.set资产端列表(inRecords);
                result.add(record);
            } catch (Exception e) {
                log.error("", e);
            }
        }
        //--write to excel
        writeToExcel(result);
    }

    public static void main(String[] args) {
        String s = "[{\"融资金额\":\"17000.00\",\"融资编码\":\"DK202304140031-01\",\"现金流出金额\":\"51.24\",\"融资渠道\":\"中国建设银行股份有限公司杭州宝石支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"4180.00\",\"融资编码\":\"DK202304120004-03\",\"现金流出金额\":\"35.59\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"6800.00\",\"融资编码\":\"DK202304120004-04\",\"现金流出金额\":\"57.70\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"14400.00\",\"融资编码\":\"DK202304140030-01\",\"现金流出金额\":\"17.22\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"14400.00\",\"融资编码\":\"DK202304140030-01\",\"现金流出金额\":\"510.00\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695398400000},{\"融资金额\":\"7378.00\",\"融资编码\":\"DK202304140030-03\",\"现金流出金额\":\"25.91\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"3700.00\",\"融资编码\":\"DK202304140030-04\",\"现金流出金额\":\"69.45\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[{\"项目名称\":\"广东禄宇3700万元售后回租项目\",\"现金流入金额\":\"36.78\",\"合同总金额\":\"3100.00\",\"合同编号\":\"中拓租【2020】租字第(A-0025)号\",\"现金流入时间\":1694707200000},{\"项目名称\":\"广东禄宇3700万元售后回租项目\",\"现金流入金额\":\"36.78\",\"合同总金额\":\"3100.00\",\"合同编号\":\"中拓租【2020】租字第(A-0026)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695052800000},{\"融资金额\":\"14500.00\",\"融资编码\":\"DK202304140030-05\",\"现金流出金额\":\"1000.05\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"4500.00\",\"融资编码\":\"DK202304140030-06\",\"现金流出金额\":\"313.59\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"10900.00\",\"融资编码\":\"DK202304140030-07\",\"现金流出金额\":\"774.22\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[{\"项目名称\":\"2022浙江湖州众创售后回租项目\",\"现金流入金额\":\"701.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0032)号\",\"现金流入时间\":1694793600000},{\"项目名称\":\"2022浙江湖州众创售后回租项目\",\"现金流入金额\":\"350.98\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0033)号\",\"现金流入时间\":1694793600000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"10900.00\",\"融资编码\":\"DK202304140030-08\",\"现金流出金额\":\"89.83\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"5800.00\",\"融资编码\":\"DK202304140030-09\",\"现金流出金额\":\"57.90\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[{\"项目名称\":\"德清同创2亿元售后回租项目\",\"现金流入金额\":\"494.05\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0088)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"7000.00\",\"融资编码\":\"DK202304140031-03\",\"现金流出金额\":\"645.26\",\"融资渠道\":\"上海浦东发展银行股份有限公司杭州德胜支行\",\"资产端列表\":[{\"项目名称\":\"2021河南骏化发展售后回租项目\",\"现金流入金额\":\"735.83\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0016)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1694707200000},{\"融资金额\":\"5800.00\",\"融资编码\":\"DK202304140031-04\",\"现金流出金额\":\"604.52\",\"融资渠道\":\"上海浦东发展银行股份有限公司杭州德胜支行\",\"资产端列表\":[{\"项目名称\":\"2021金帝联合能源售后回租项目\",\"现金流入金额\":\"712.67\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0026)号\",\"现金流入时间\":1693756800000}],\"现金流出时间\":1693756800000},{\"融资金额\":\"2100.00\",\"融资编码\":\"DK202304140031-08\",\"现金流出金额\":\"178.62\",\"融资渠道\":\"上海浦东发展银行股份有限公司杭州德胜支行\",\"资产端列表\":[{\"项目名称\":\"穗深冷链8000万项目立项申请\",\"现金流入金额\":\"275.00\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0103)号\",\"现金流入时间\":1693497600000}],\"现金流出时间\":1693584000000},{\"融资金额\":\"4200.00\",\"融资编码\":\"DK202304140024-01\",\"现金流出金额\":\"602.35\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[{\"项目名称\":\"山西高义钢铁有限公司1.12亿元售后回租项目\",\"现金流入金额\":\"1058.15\",\"合同总金额\":\"11200.00\",\"合同编号\":\"中拓租【2020】租字第(A-0020)号\",\"现金流入时间\":1694275200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2000.00\",\"融资编码\":\"DK202304140024-02\",\"现金流出金额\":\"200.78\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[{\"项目名称\":\"山西高义钢铁有限公司1.12亿元售后回租项目\",\"现金流入金额\":\"1058.15\",\"合同总金额\":\"11200.00\",\"合同编号\":\"中拓租【2020】租字第(A-0020)号\",\"现金流入时间\":1694275200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2700.00\",\"融资编码\":\"DK202304140024-03\",\"现金流出金额\":\"0.40\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"2934.00\",\"融资编码\":\"DK202304140024-04\",\"现金流出金额\":\"151.16\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[{\"项目名称\":\"2021山东仁丰特种售后回租项目\",\"现金流入金额\":\"169.60\",\"合同总金额\":\"3260.00\",\"合同编号\":\"浙商租【2021】租字第(A-0033)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"6384.00\",\"融资编码\":\"DK202304140024-05\",\"现金流出金额\":\"6.27\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"7320.00\",\"融资编码\":\"DK202304140024-06\",\"现金流出金额\":\"624.50\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[{\"项目名称\":\"2021宁波市奉化区售后回租项目\",\"现金流入金额\":\"701.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0058)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"9840.00\",\"融资编码\":\"DK202304140024-07\",\"现金流出金额\":\"33.73\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"8900.00\",\"融资编码\":\"DK202304140024-08\",\"现金流出金额\":\"924.41\",\"融资渠道\":\"华夏银行股份有限公司杭州滨江支行\",\"资产端列表\":[{\"项目名称\":\"2022湖北金盛兰冶售后回租项目\",\"现金流入金额\":\"986.48\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0086)号\",\"现金流入时间\":1694275200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"7160.00\",\"融资编码\":\"DK202304110001-03\",\"现金流出金额\":\"1031.24\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2021山西通才工贸售后回租项目\",\"现金流入金额\":\"1283.52\",\"合同总金额\":\"11800.00\",\"合同编号\":\"浙商租【2021】租字第(A-0010)号\",\"现金流入时间\":1693497600000}],\"现金流出时间\":1693584000000},{\"融资金额\":\"6200.00\",\"融资编码\":\"DK202304110001-04\",\"现金流出金额\":\"528.00\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2021昌乐新迈纸业售后回租项目\",\"现金流入金额\":\"660.61\",\"合同总金额\":\"7200.00\",\"合同编号\":\"浙商租【2021】租字第(A-0060)号\",\"现金流入时间\":1694275200000}],\"现金流出时间\":1694275200000},{\"融资金额\":\"6200.00\",\"融资编码\":\"DK202304110001-04\",\"现金流出金额\":\"36.00\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2021昌乐新迈纸业售后回租项目\",\"现金流入金额\":\"660.61\",\"合同总金额\":\"7200.00\",\"合同编号\":\"浙商租【2021】租字第(A-0060)号\",\"现金流入时间\":1694275200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"7000.00\",\"融资编码\":\"DK202304110001-05\",\"现金流出金额\":\"587.60\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2022福建龙麟集团售后回租项目\",\"现金流入金额\":\"734.58\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0043)号\",\"现金流入时间\":1693843200000}],\"现金流出时间\":1693843200000},{\"融资金额\":\"7000.00\",\"融资编码\":\"DK202304110001-05\",\"现金流出金额\":\"15.48\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2022福建龙麟集团售后回租项目\",\"现金流入金额\":\"734.58\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0043)号\",\"现金流入时间\":1693843200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"6800.00\",\"融资编码\":\"DK202304110001-06\",\"现金流出金额\":\"101.00\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2022山西通才工贸售后回租项目\",\"现金流入金额\":\"126.77\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0053)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1694707200000},{\"融资金额\":\"6800.00\",\"融资编码\":\"DK202304110001-06\",\"现金流出金额\":\"14.61\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2022山西通才工贸售后回租项目\",\"现金流入金额\":\"126.77\",\"合同总金额\":\"8000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0053)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2960.00\",\"融资编码\":\"DK202304110001-07\",\"现金流出金额\":\"23.78\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2022山西晋南钢铁售后回租项目\",\"现金流入金额\":\"553.49\",\"合同总金额\":\"4000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0077)号\",\"现金流入时间\":1695571200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"2960.00\",\"融资编码\":\"DK202304110001-07\",\"现金流出金额\":\"442.79\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"2022山西晋南钢铁售后回租项目\",\"现金流入金额\":\"553.49\",\"合同总金额\":\"4000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0077)号\",\"现金流入时间\":1695571200000}],\"现金流出时间\":1695571200000},{\"融资金额\":\"3470.00\",\"融资编码\":\"DK202304110001-08\",\"现金流出金额\":\"366.58\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"山西天恒氢能科技有限公司4000万氢能车辆回租\",\"现金流入金额\":\"376.92\",\"合同总金额\":\"4000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0078)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"4577.00\",\"融资编码\":\"DK202304140021-03\",\"现金流出金额\":\"5.40\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"4577.00\",\"融资编码\":\"DK202304140021-03\",\"现金流出金额\":\"199.26\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1696003200000},{\"融资金额\":\"4589.00\",\"融资编码\":\"DK202304140021-04\",\"现金流出金额\":\"399.29\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021诸暨华海氨纶售后回租项目\",\"现金流入金额\":\"441.30\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0074)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"4589.00\",\"融资编码\":\"DK202304140021-04\",\"现金流出金额\":\"8.76\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021诸暨华海氨纶售后回租项目\",\"现金流入金额\":\"441.30\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0074)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"5200.00\",\"融资编码\":\"DK202304140021-05\",\"现金流出金额\":\"153.70\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022清徐县美特好售后回租项目\",\"现金流入金额\":\"170.53\",\"合同总金额\":\"5500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0020)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1693670400000},{\"融资金额\":\"5200.00\",\"融资编码\":\"DK202304140021-05\",\"现金流出金额\":\"10.77\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022清徐县美特好售后回租项目\",\"现金流入金额\":\"170.53\",\"合同总金额\":\"5500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0020)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2820.00\",\"融资编码\":\"DK202304140021-06\",\"现金流出金额\":\"6.44\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022湖北绿色家园售后回租项目\",\"现金流入金额\":\"92.19\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0042)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2820.00\",\"融资编码\":\"DK202304140021-06\",\"现金流出金额\":\"83.01\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022湖北绿色家园售后回租项目\",\"现金流入金额\":\"92.19\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0042)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695571200000},{\"融资金额\":\"4970.00\",\"融资编码\":\"DK202304140021-07\",\"现金流出金额\":\"410.00\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021诸暨华海氨纶售后回租项目\",\"现金流入金额\":\"454.00\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0036)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"4970.00\",\"融资编码\":\"DK202304140021-07\",\"现金流出金额\":\"10.80\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021诸暨华海氨纶售后回租项目\",\"现金流入金额\":\"454.00\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0036)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304140021-08\",\"现金流出金额\":\"69.96\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022清徐县美特好售后回租项目\",\"现金流入金额\":\"77.52\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0038)号\",\"现金流入时间\":1694188800000}],\"现金流出时间\":1694620800000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304140021-08\",\"现金流出金额\":\"5.62\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022清徐县美特好售后回租项目\",\"现金流入金额\":\"77.52\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0038)号\",\"现金流入时间\":1694188800000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2344.00\",\"融资编码\":\"DK202304140021-09\",\"现金流出金额\":\"67.16\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022山西万美医药直接租赁项目\",\"现金流入金额\":\"74.43\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2022】租字第(C-0006)号\",\"现金流入时间\":1694016000000}],\"现金流出时间\":1694448000000},{\"融资金额\":\"2344.00\",\"融资编码\":\"DK202304140021-09\",\"现金流出金额\":\"5.67\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022山西万美医药直接租赁项目\",\"现金流入金额\":\"74.43\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2022】租字第(C-0006)号\",\"现金流入时间\":1694016000000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2720.00\",\"融资编码\":\"DK202304140021-10\",\"现金流出金额\":\"6.41\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"3690.00\",\"融资编码\":\"DK202304140021-11\",\"现金流出金额\":\"466.50\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"东莞市金田纸业有限公司5000万元售后回租项目\",\"现金流入金额\":\"516.80\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0023)号\",\"现金流入时间\":1694361600000}],\"现金流出时间\":1694793600000},{\"融资金额\":\"3690.00\",\"融资编码\":\"DK202304140021-11\",\"现金流出金额\":\"6.32\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"东莞市金田纸业有限公司5000万元售后回租项目\",\"现金流入金额\":\"516.80\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0023)号\",\"现金流入时间\":1694361600000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"5490.00\",\"融资编码\":\"DK202304140021-12\",\"现金流出金额\":\"14.54\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022攀枝花市公共售后回租项目\",\"现金流入金额\":\"508.38\",\"合同总金额\":\"5600.00\",\"合同编号\":\"浙商租【2022】租字第(A-0067)号\",\"现金流入时间\":1695657600000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2770.00\",\"融资编码\":\"DK202304140021-13\",\"现金流出金额\":\"77.15\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022福建鑫宏兴航售后回租项目\",\"现金流入金额\":\"42.80\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0072)号\",\"现金流入时间\":1695830400000},{\"项目名称\":\"2022福建鑫宏兴航售后回租项目\",\"现金流入金额\":\"42.80\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0073)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1693584000000},{\"融资金额\":\"2770.00\",\"融资编码\":\"DK202304140021-13\",\"现金流出金额\":\"7.33\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022福建鑫宏兴航售后回租项目\",\"现金流入金额\":\"42.80\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0072)号\",\"现金流入时间\":1695830400000},{\"项目名称\":\"2022福建鑫宏兴航售后回租项目\",\"现金流入金额\":\"42.80\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2022】租字第(A-0073)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"5266.00\",\"融资编码\":\"DK202304120003-04\",\"现金流出金额\":\"37.27\",\"融资渠道\":\"杭州银行股份有限公司保俶支行\",\"资产端列表\":[{\"项目名称\":\"贵州通源投资集团有限公司回租项目\",\"现金流入金额\":\"175.70\",\"合同总金额\":\"4000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0117)号\",\"现金流入时间\":1694448000000},{\"项目名称\":\"贵州通源投资集团有限公司回租项目\",\"现金流入金额\":\"87.85\",\"合同总金额\":\"2000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0119)号\",\"现金流入时间\":1695398400000},{\"项目名称\":\"贵州通源投资集团有限公司回租项目\",\"现金流入金额\":\"87.85\",\"合同总金额\":\"2000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0120)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"633.00\",\"融资编码\":\"DK202304140010-03\",\"现金流出金额\":\"7.85\",\"融资渠道\":\"湖州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"镔鑫钢铁2020年1亿元售后回租项目\",\"现金流入金额\":\"905.42\",\"合同总金额\":\"10000.00\",\"合同编号\":\"中拓租【2020】租字第(A-0030)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"633.00\",\"融资编码\":\"DK202304140010-03\",\"现金流出金额\":\"633.09\",\"融资渠道\":\"湖州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"镔鑫钢铁2020年1亿元售后回租项目\",\"现金流入金额\":\"905.42\",\"合同总金额\":\"10000.00\",\"合同编号\":\"中拓租【2020】租字第(A-0030)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695312000000},{\"融资金额\":\"633.00\",\"融资编码\":\"DK202304140010-04\",\"现金流出金额\":\"7.85\",\"融资渠道\":\"湖州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"镔鑫钢铁2020年1亿元售后回租项目\",\"现金流入金额\":\"905.42\",\"合同总金额\":\"10000.00\",\"合同编号\":\"中拓租【2020】租字第(A-0030)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"3400.00\",\"融资编码\":\"DK202304140010-05\",\"现金流出金额\":\"17.99\",\"融资渠道\":\"湖州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021昌乐新迈纸业售后回租项目\",\"现金流入金额\":\"548.37\",\"合同总金额\":\"6000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0034)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"3400.00\",\"融资编码\":\"DK202304140010-05\",\"现金流出金额\":\"380.05\",\"融资渠道\":\"湖州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021昌乐新迈纸业售后回租项目\",\"现金流入金额\":\"548.37\",\"合同总金额\":\"6000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0034)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695312000000},{\"融资金额\":\"10000.00\",\"融资编码\":\"DK202304140010-06\",\"现金流出金额\":\"108.58\",\"融资渠道\":\"湖州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"湖州织里童装园区1.5亿元售后回租项目\",\"现金流入金额\":\"119.00\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0104)号\",\"现金流入时间\":1694448000000},{\"项目名称\":\"湖州织里童装园区1.5亿元售后回租项目\",\"现金流入金额\":\"59.50\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0105)号\",\"现金流入时间\":1694448000000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"7000.00\",\"融资编码\":\"DK202304140019-01\",\"现金流出金额\":\"816.46\",\"融资渠道\":\"南京银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021诸暨市城东新售后回租项目\",\"现金流入金额\":\"701.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0045)号\",\"现金流入时间\":1695744000000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"12000.00\",\"融资编码\":\"DK202304140018-01\",\"现金流出金额\":\"81.89\",\"融资渠道\":\"上海银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2021德清县城市建售后回租项目\",\"现金流入金额\":\"1052.94\",\"合同总金额\":\"15000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0049)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"4800.00\",\"融资编码\":\"DK202304140018-02\",\"现金流出金额\":\"34.28\",\"融资渠道\":\"上海银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"8000.00\",\"融资编码\":\"DK202304140008-02\",\"现金流出金额\":\"49.60\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"8500.00\",\"融资编码\":\"DK202304140008-03\",\"现金流出金额\":\"73.65\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"4200.00\",\"融资编码\":\"DK202304140008-04\",\"现金流出金额\":\"280.74\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022兰溪市聚源建售后回租项目\",\"现金流入金额\":\"347.44\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0096)号\",\"现金流入时间\":1694448000000}],\"现金流出时间\":1694707200000},{\"融资金额\":\"4200.00\",\"融资编码\":\"DK202304140008-04\",\"现金流出金额\":\"36.13\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022兰溪市聚源建售后回租项目\",\"现金流入金额\":\"347.44\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0096)号\",\"现金流入时间\":1694448000000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"14700.00\",\"融资编码\":\"DK202304140008-05\",\"现金流出金额\":\"114.98\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"湖州经开投资发展集团有限公司2亿元售后回租项目\",\"现金流入金额\":\"628.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0017)号\",\"现金流入时间\":1695916800000},{\"项目名称\":\"湖州经开投资发展集团有限公司2亿元售后回租项目\",\"现金流入金额\":\"628.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0018)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"27000.00\",\"融资编码\":\"DK202304140015-01\",\"现金流出金额\":\"82.42\",\"融资渠道\":\"中国工商银行杭州市武林支行\",\"资产端列表\":[{\"项目名称\":\"2021浙江逸盛新材售后回租项目\",\"现金流入金额\":\"745.20\",\"合同总金额\":\"15000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0062)号\",\"现金流入时间\":1695571200000},{\"项目名称\":\"2021浙江逸盛新材售后回租项目\",\"现金流入金额\":\"745.20\",\"合同总金额\":\"15000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0061)号\",\"现金流入时间\":1694707200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"5485.33\",\"融资编码\":\"DK202304140025-01\",\"现金流出金额\":\"22.95\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"8000.00\",\"融资编码\":\"DK202304140025-02\",\"现金流出金额\":\"62.72\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2021宁波市奉化区售后回租项目\",\"现金流入金额\":\"701.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0057)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"8000.00\",\"融资编码\":\"DK202304140025-02\",\"现金流出金额\":\"488.68\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2021宁波市奉化区售后回租项目\",\"现金流入金额\":\"701.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0057)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695398400000},{\"融资金额\":\"3595.00\",\"融资编码\":\"DK202304140025-03\",\"现金流出金额\":\"13.43\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2021浙江豪邦化工售后回租项目\",\"现金流入金额\":\"521.21\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0048)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"3595.00\",\"融资编码\":\"DK202304140025-03\",\"现金流出金额\":\"400.00\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2021浙江豪邦化工售后回租项目\",\"现金流入金额\":\"521.21\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0048)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695398400000},{\"融资金额\":\"2279.14\",\"融资编码\":\"DK202304140025-04\",\"现金流出金额\":\"67.12\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2021山西万美医药售后回租项目\",\"现金流入金额\":\"92.40\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0075)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1693756800000},{\"融资金额\":\"2279.14\",\"融资编码\":\"DK202304140025-04\",\"现金流出金额\":\"14.72\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2021山西万美医药售后回租项目\",\"现金流入金额\":\"92.40\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0075)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"6450.00\",\"融资编码\":\"DK202304140025-05\",\"现金流出金额\":\"61.13\",\"融资渠道\":\"江苏银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022华泓水务0.9亿元售后回租项目\",\"现金流入金额\":\"93.75\",\"合同总金额\":\"9000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0107)号\",\"现金流入时间\":1694448000000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"12000.00\",\"融资编码\":\"DK202304140031-09\",\"现金流出金额\":\"92.64\",\"融资渠道\":\"浙商银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022兰溪市交通建售后回租项目\",\"现金流入金额\":\"1048.68\",\"合同总金额\":\"15000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0041)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"12000.00\",\"融资编码\":\"DK202304140031-09\",\"现金流出金额\":\"724.29\",\"融资渠道\":\"浙商银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022兰溪市交通建售后回租项目\",\"现金流入金额\":\"1048.68\",\"合同总金额\":\"15000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0041)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695916800000},{\"融资金额\":\"3000.00\",\"融资编码\":\"DK202304140031-11\",\"现金流出金额\":\"157.29\",\"融资渠道\":\"浙商银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022淄博飞源化工售后回租项目\",\"现金流入金额\":\"158.25\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0118)号\",\"现金流入时间\":1695312000000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"8700.00\",\"融资编码\":\"DK202304140023-01\",\"现金流出金额\":\"61.95\",\"融资渠道\":\"温州银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"14000.00\",\"融资编码\":\"DK202304140023-02\",\"现金流出金额\":\"303.05\",\"融资渠道\":\"温州银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1693584000000},{\"融资金额\":\"14000.00\",\"融资编码\":\"DK202304140023-02\",\"现金流出金额\":\"165.72\",\"融资渠道\":\"温州银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"8700.00\",\"融资编码\":\"DK202304140023-03\",\"现金流出金额\":\"95.13\",\"融资渠道\":\"温州银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"苍南公投1亿元售后回租项目\",\"现金流入金额\":\"1105.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0092)号\",\"现金流入时间\":1695571200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"10000.00\",\"融资编码\":\"DK202304140031-16\",\"现金流出金额\":\"904.00\",\"融资渠道\":\"平安国际融资租赁有限公司\",\"资产端列表\":[{\"项目名称\":\"丹阳丹昇新农村1亿元售后回租项目\",\"现金流入金额\":\"904.00\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0015)号\",\"现金流入时间\":1694880000000}],\"现金流出时间\":1695484800000},{\"融资金额\":\"9500.00\",\"融资编码\":\"DK202304140013-01\",\"现金流出金额\":\"237.50\",\"融资渠道\":\"广发银行杭州西湖支行\",\"资产端列表\":[],\"现金流出时间\":1693756800000},{\"融资金额\":\"20000.00\",\"融资编码\":\"DK202304140026-01\",\"现金流出金额\":\"2500.00\",\"融资渠道\":\"浙江萧山农村商业银行股份有限公司城北支行\",\"资产端列表\":[{\"项目名称\":\"丹阳练湖水城1亿元售后回租项目\",\"现金流入金额\":\"1128.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0122)号\",\"现金流入时间\":1693497600000}],\"现金流出时间\":1693670400000},{\"融资金额\":\"20000.00\",\"融资编码\":\"DK202304140026-01\",\"现金流出金额\":\"177.81\",\"融资渠道\":\"浙江萧山农村商业银行股份有限公司城北支行\",\"资产端列表\":[{\"项目名称\":\"丹阳练湖水城1亿元售后回租项目\",\"现金流入金额\":\"1128.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0122)号\",\"现金流入时间\":1693497600000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"30600.00\",\"融资编码\":\"DK202304140031-17\",\"现金流出金额\":\"2976.55\",\"融资渠道\":\"兴业银行股份有限公司杭州湖滨支行\",\"资产端列表\":[{\"项目名称\":\"浙江浙商融资租赁有限公司关于淮安市淮创商务有限公司 1亿元售后回租项目尽调报告\",\"现金流入金额\":\"1328.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0127)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022海创投资发展售后回租项目\",\"现金流入金额\":\"397.71\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0116)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022南浔美丽村镇1.5亿元售后回租项目\",\"现金流入金额\":\"563.75\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0124)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022泰兴港口集团售后回租项目\",\"现金流入金额\":\"950.21\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0011)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022宁波经开科技售后回租项目\",\"现金流入金额\":\"263.13\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0082)号\",\"现金流入时间\":1694102400000}],\"现金流出时间\":1694448000000},{\"融资金额\":\"30600.00\",\"融资编码\":\"DK202304140031-17\",\"现金流出金额\":\"300.31\",\"融资渠道\":\"兴业银行股份有限公司杭州湖滨支行\",\"资产端列表\":[{\"项目名称\":\"浙江浙商融资租赁有限公司关于淮安市淮创商务有限公司 1亿元售后回租项目尽调报告\",\"现金流入金额\":\"1328.75\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0127)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022海创投资发展售后回租项目\",\"现金流入金额\":\"397.71\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0116)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022南浔美丽村镇1.5亿元售后回租项目\",\"现金流入金额\":\"563.75\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0124)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022泰兴港口集团售后回租项目\",\"现金流入金额\":\"950.21\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0011)号\",\"现金流入时间\":1694016000000},{\"项目名称\":\"2022宁波经开科技售后回租项目\",\"现金流入金额\":\"263.13\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0082)号\",\"现金流入时间\":1694102400000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"4250.00\",\"融资编码\":\"DK202304140022-13\",\"现金流出金额\":\"4250.00\",\"融资渠道\":\"中信银行杭州萧山支行\",\"资产端列表\":[],\"现金流出时间\":1693497600000},{\"融资金额\":\"4700.00\",\"融资编码\":\"DK202304140031-18\",\"现金流出金额\":\"4700.00\",\"融资渠道\":\"浙商银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"2022杭州萧山江南售后回租项目\",\"现金流入金额\":\"144.98\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0070)号\",\"现金流入时间\":1695052800000}],\"现金流出时间\":1695052800000},{\"融资金额\":\"48000.00\",\"融资编码\":\"DK202305170033-01\",\"现金流出金额\":\"173.60\",\"融资渠道\":\"浙江浙商金控有限公司\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"14.25\",\"融资编码\":\"ZR2023071101\",\"现金流出金额\":\"15742.67\",\"融资渠道\":\"直租-浙商租赁华泰1期ABS\",\"资产端列表\":[{\"项目名称\":\"临杭物流1.995亿元售后回租项目\",\"现金流入金额\":\"783.73\",\"合同总金额\":\"19950.00\",\"合同编号\":\"中拓租【2020】租字第(A-0004)号\",\"现金流入时间\":1695139200000},{\"项目名称\":\"东部新城、织里童投2亿元联合承租项目\",\"现金流入金额\":\"1384.75\",\"合同总金额\":\"20000.00\",\"合同编号\":\"中拓租【2020】租字第(A-0009)号\",\"现金流入时间\":1695139200000},{\"项目名称\":\"德清县下渚湖湿地旅游发展有限公司2亿元售后回租项目\",\"现金流入金额\":\"789.38\",\"合同总金额\":\"11200.00\",\"合同编号\":\"中拓租【2020】租字第(A-0018)号\",\"现金流入时间\":1695139200000},{\"项目名称\":\"德清县下渚湖湿地旅游发展有限公司2亿元售后回租项目\",\"现金流入金额\":\"620.22\",\"合同总金额\":\"8800.00\",\"合同编号\":\"中拓租【2020】租字第(A-0019)号\",\"现金流入时间\":1695139200000},{\"项目名称\":\"2021舟山市定海宝售后回租项目\",\"现金流入金额\":\"528.60\",\"合同总金额\":\"7500.00\",\"合同编号\":\"浙商租【2021】租字第(A-0053)号\",\"现金流入时间\":1694707200000},{\"项目名称\":\"2021舟山市定海宝售后回租项目\",\"现金流入金额\":\"528.60\",\"合同总金额\":\"7500.00\",\"合同编号\":\"浙商租【2021】租字第(A-0054)号\",\"现金流入时间\":1694707200000},{\"项目名称\":\"2021嵊州市交通发售后回租项目\",\"现金流入金额\":\"1456.60\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0006)号\",\"现金流入时间\":1693756800000},{\"项目名称\":\"诸暨市新城投资开发集团有限公司2亿元售后回租项目\",\"现金流入金额\":\"694.77\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0019)号\",\"现金流入时间\":1696003200000},{\"项目名称\":\"诸暨市新城投资开发集团有限公司2亿元售后回租项目\",\"现金流入金额\":\"694.77\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0018)号\",\"现金流入时间\":1696003200000},{\"项目名称\":\"奉化城投2亿元回租项目\",\"现金流入金额\":\"705.01\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0044)号\",\"现金流入时间\":1695139200000},{\"项目名称\":\"奉化城投2亿元回租项目\",\"现金流入金额\":\"705.01\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0043)号\",\"现金流入时间\":1695139200000},{\"项目名称\":\"2021诸暨市城东新售后回租项目\",\"现金流入金额\":\"701.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2021】租字第(A-0046)号\",\"现金流入时间\":1695744000000}],\"现金流出时间\":1693756800000},{\"融资金额\":\"7437.50\",\"融资编码\":\"DK202304140012-02\",\"现金流出金额\":\"24.59\",\"融资渠道\":\"中国农业银行股份有限公司杭州保俶支行\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"1250.00\",\"融资编码\":\"DK202304140031-21\",\"现金流出金额\":\"57.33\",\"融资渠道\":\"兴业银行股份有限公司杭州湖滨支行\",\"资产端列表\":[{\"项目名称\":\"广州南菱汽车股份有限公司租赁项目\",\"现金流入金额\":\"66.04\",\"合同总金额\":\"1500.00\",\"合同编号\":\"浙商租【2023】租字第(A-0048)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1693670400000},{\"融资金额\":\"1250.00\",\"融资编码\":\"DK202304140031-21\",\"现金流出金额\":\"2.40\",\"融资渠道\":\"兴业银行股份有限公司杭州湖滨支行\",\"资产端列表\":[{\"项目名称\":\"广州南菱汽车股份有限公司租赁项目\",\"现金流入金额\":\"66.04\",\"合同总金额\":\"1500.00\",\"合同编号\":\"浙商租【2023】租字第(A-0048)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"8550.00\",\"融资编码\":\"DK202304140008-07\",\"现金流出金额\":\"540.00\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1693929600000},{\"融资金额\":\"8550.00\",\"融资编码\":\"DK202304140008-07\",\"现金流出金额\":\"92.99\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"8550.00\",\"融资编码\":\"DK202304140008-08\",\"现金流出金额\":\"554.35\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1693929600000},{\"融资金额\":\"8550.00\",\"融资编码\":\"DK202304140008-08\",\"现金流出金额\":\"75.64\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304120004-05\",\"现金流出金额\":\"106.00\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"欧龙汽车贸易集团有限公司租赁项目\",\"现金流入金额\":\"132.08\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0063)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1693584000000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304120004-05\",\"现金流出金额\":\"25.02\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"欧龙汽车贸易集团有限公司租赁项目\",\"现金流入金额\":\"132.08\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0063)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"12000.00\",\"融资编码\":\"DK202304140030-11\",\"现金流出金额\":\"120.09\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"14000.00\",\"融资编码\":\"DK202304140030-10\",\"现金流出金额\":\"128.94\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"6500.00\",\"融资编码\":\"DK202304140022-20\",\"现金流出金额\":\"21.83\",\"融资渠道\":\"中信银行杭州萧山支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"30000.00\",\"融资编码\":\"DK202304140027-02\",\"现金流出金额\":\"2786.50\",\"融资渠道\":\"瑞穗银行（中国）有限公司\",\"资产端列表\":[{\"项目名称\":\"舟山市定海区金塘北部开发投资有限公司1.5亿元售后回租项目\",\"现金流入金额\":\"128.00\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0040)号\",\"现金流入时间\":1694620800000},{\"项目名称\":\"舟山市定海区金塘北部开发投资有限公司1.5亿元售后回租项目\",\"现金流入金额\":\"64.00\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0042)号\",\"现金流入时间\":1694620800000},{\"项目名称\":\"2023德清城建1.9亿元售后回租项目\",\"现金流入金额\":\"119.78\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0035)号\",\"现金流入时间\":1694620800000},{\"项目名称\":\"2023德清城建1.9亿元售后回租项目\",\"现金流入金额\":\"107.80\",\"合同总金额\":\"9000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0036)号\",\"现金流入时间\":1694620800000}],\"现金流出时间\":1694793600000},{\"融资金额\":\"4742.00\",\"融资编码\":\"DK202304140021-14\",\"现金流出金额\":\"15.16\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"2449.00\",\"融资编码\":\"DK202304140021-15\",\"现金流出金额\":\"144.63\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022江苏创网通信售后回租项目\",\"现金流入金额\":\"160.18\",\"合同总金额\":\"2750.00\",\"合同编号\":\"浙商租【2022】租字第(A-0099)号\",\"现金流入时间\":1694534400000}],\"现金流出时间\":1694966400000},{\"融资金额\":\"2449.00\",\"融资编码\":\"DK202304140021-15\",\"现金流出金额\":\"7.81\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022江苏创网通信售后回租项目\",\"现金流入金额\":\"160.18\",\"合同总金额\":\"2750.00\",\"合同编号\":\"浙商租【2022】租字第(A-0099)号\",\"现金流入时间\":1694534400000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"7850.00\",\"融资编码\":\"DK202306200035-02\",\"现金流出金额\":\"59.79\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"8550.00\",\"融资编码\":\"DK202306200035-01\",\"现金流出金额\":\"553.88\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1693929600000},{\"融资金额\":\"8550.00\",\"融资编码\":\"DK202306200035-01\",\"现金流出金额\":\"67.47\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"3600.00\",\"融资编码\":\"DK202304140019-05\",\"现金流出金额\":\"331.92\",\"融资渠道\":\"南京银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"安吉紫梅实业3亿元售后回租项目\",\"现金流入金额\":\"472.92\",\"合同总金额\":\"5000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0080)号\",\"现金流入时间\":1693584000000}],\"现金流出时间\":1693756800000},{\"融资金额\":\"7400.00\",\"融资编码\":\"DK202304140019-04\",\"现金流出金额\":\"665.61\",\"融资渠道\":\"南京银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"安吉紫梅实业3亿元售后回租项目\",\"现金流入金额\":\"945.83\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0075)号\",\"现金流入时间\":1693584000000}],\"现金流出时间\":1693756800000},{\"融资金额\":\"17000.00\",\"融资编码\":\"DK202306200035-03\",\"现金流出金额\":\"129.96\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"金义发展3亿元售后回租项目\",\"现金流入金额\":\"117.50\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0072)号\",\"现金流入时间\":1695657600000},{\"项目名称\":\"金义发展3亿元售后回租项目\",\"现金流入金额\":\"117.50\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0073)号\",\"现金流入时间\":1695657600000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"17000.00\",\"融资编码\":\"DK202306200035-03\",\"现金流出金额\":\"168.10\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"金义发展3亿元售后回租项目\",\"现金流入金额\":\"117.50\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0072)号\",\"现金流入时间\":1695657600000},{\"项目名称\":\"金义发展3亿元售后回租项目\",\"现金流入金额\":\"117.50\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0073)号\",\"现金流入时间\":1695657600000}],\"现金流出时间\":1695830400000},{\"融资金额\":\"15000.00\",\"融资编码\":\"DK202306200035-04\",\"现金流出金额\":\"113.33\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"吴兴产投3亿元回租项目\",\"现金流入金额\":\"262.89\",\"合同总金额\":\"20000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0081)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"15000.00\",\"融资编码\":\"DK202306200035-04\",\"现金流出金额\":\"180.00\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"吴兴产投3亿元回租项目\",\"现金流入金额\":\"262.89\",\"合同总金额\":\"20000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0081)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1695830400000},{\"融资金额\":\"9950.00\",\"融资编码\":\"DK202304140031-24\",\"现金流出金额\":\"121.24\",\"融资渠道\":\"平安国际融资租赁有限公司\",\"资产端列表\":[{\"项目名称\":\"莆田荔城金宝1亿元售后回租项目\",\"现金流入金额\":\"121.24\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0027)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1696003200000},{\"融资金额\":\"26000.00\",\"融资编码\":\"DK202306200035-05\",\"现金流出金额\":\"194.13\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"湖州吴兴南太湖建设投资集团有限公司3亿元售后回租项目\",\"现金流入金额\":\"240.50\",\"合同总金额\":\"20000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0101)号\",\"现金流入时间\":1696003200000},{\"项目名称\":\"湖州吴兴南太湖建设投资集团有限公司3亿元售后回租项目\",\"现金流入金额\":\"120.25\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0102)号\",\"现金流入时间\":1696003200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"10000.00\",\"融资编码\":\"DK202305250034-03\",\"现金流出金额\":\"75.56\",\"融资渠道\":\"中国邮政储蓄银行股份有限公司杭州市分行营业部\",\"资产端列表\":[{\"项目名称\":\"吴兴产投3亿元回租项目\",\"现金流入金额\":\"132.17\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0082)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"10000.00\",\"融资编码\":\"DK202305250034-03\",\"现金流出金额\":\"120.00\",\"融资渠道\":\"中国邮政储蓄银行股份有限公司杭州市分行营业部\",\"资产端列表\":[{\"项目名称\":\"吴兴产投3亿元回租项目\",\"现金流入金额\":\"132.17\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0082)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1695830400000},{\"融资金额\":\"1690.00\",\"融资编码\":\"DK202304140031-22\",\"现金流出金额\":\"211.27\",\"融资渠道\":\"上海浦东发展银行股份有限公司杭州德胜支行\",\"资产端列表\":[{\"项目名称\":\"卓智网络3000万租赁项目立项报告\",\"现金流入金额\":\"264.27\",\"合同总金额\":\"2000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0037)号\",\"现金流入时间\":1693584000000}],\"现金流出时间\":1693584000000},{\"融资金额\":\"1750.00\",\"融资编码\":\"DK202304140031-23\",\"现金流出金额\":\"140.83\",\"融资渠道\":\"上海浦东发展银行股份有限公司杭州德胜支行\",\"资产端列表\":[{\"项目名称\":\"穗深冷链8000万项目立项申请\",\"现金流入金额\":\"182.45\",\"合同总金额\":\"2000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0038)号\",\"现金流入时间\":1693497600000}],\"现金流出时间\":1693497600000},{\"融资金额\":\"29000.00\",\"融资编码\":\"DK202304140027-03\",\"现金流出金额\":\"2665.83\",\"融资渠道\":\"瑞穗银行（中国）有限公司\",\"资产端列表\":[{\"项目名称\":\"成都空港产业兴城投资发展有限公司2亿元售后回租项目\",\"现金流入金额\":\"923.24\",\"合同总金额\":\"10200.00\",\"合同编号\":\"浙商租【2023】租字第(A-0084)号\",\"现金流入时间\":1695830400000},{\"项目名称\":\"成都空港产业兴城投资发展有限公司2亿元售后回租项目\",\"现金流入金额\":\"887.03\",\"合同总金额\":\"9800.00\",\"合同编号\":\"浙商租【2023】租字第(A-0087)号\",\"现金流入时间\":1695830400000},{\"项目名称\":\"金义发展3亿元售后回租项目\",\"现金流入金额\":\"45.96\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0074)号\",\"现金流入时间\":1695830400000},{\"项目名称\":\"成都市新益州城市建设发展有限公司2亿元售后回租项目\",\"现金流入金额\":\"1186.25\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0094)号\",\"现金流入时间\":1695830400000}],\"现金流出时间\":1695830400000},{\"融资金额\":\"5000.00\",\"融资编码\":\"DK202304140021-16\",\"现金流出金额\":\"16.79\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"25300.00\",\"融资编码\":\"DK202306200035-06\",\"现金流出金额\":\"189.12\",\"融资渠道\":\"北京银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"20000.00\",\"融资编码\":\"DK202304140031-25\",\"现金流出金额\":\"149.11\",\"融资渠道\":\"浙商银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695139200000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304120004-06\",\"现金流出金额\":\"105.00\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"欧龙汽车贸易集团有限公司租赁项目\",\"现金流入金额\":\"132.08\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0108)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695139200000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304120004-06\",\"现金流出金额\":\"18.85\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"欧龙汽车贸易集团有限公司租赁项目\",\"现金流入金额\":\"132.08\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0108)号\",\"现金流入时间\":1695139200000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"30000.00\",\"融资编码\":\"DK202305250034-04\",\"现金流出金额\":\"239.24\",\"融资渠道\":\"中国邮政储蓄银行股份有限公司杭州市分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"10000.00\",\"融资编码\":\"DK202304140022-21\",\"现金流出金额\":\"33.58\",\"融资渠道\":\"中信银行杭州萧山支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"7200.00\",\"融资编码\":\"DK202304140015-04\",\"现金流出金额\":\"923.76\",\"融资渠道\":\"中国工商银行杭州市武林支行\",\"资产端列表\":[],\"现金流出时间\":1693584000000},{\"融资金额\":\"9200.00\",\"融资编码\":\"DK202304140022-23\",\"现金流出金额\":\"30.90\",\"融资渠道\":\"中信银行杭州萧山支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"3000.00\",\"融资编码\":\"DK202304140022-25\",\"现金流出金额\":\"10.08\",\"融资渠道\":\"中信银行杭州萧山支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"3280.00\",\"融资编码\":\"DK202304120004-07\",\"现金流出金额\":\"9.95\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"长久汽车回租项目\",\"现金流入金额\":\"342.61\",\"合同总金额\":\"4000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0113)号\",\"现金流入时间\":1695484800000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"3280.00\",\"融资编码\":\"DK202304120004-07\",\"现金流出金额\":\"275.00\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"长久汽车回租项目\",\"现金流入金额\":\"342.61\",\"合同总金额\":\"4000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0113)号\",\"现金流入时间\":1695484800000}],\"现金流出时间\":1695744000000},{\"融资金额\":\"7560.00\",\"融资编码\":\"DK202304140021-17\",\"现金流出金额\":\"124.74\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022四川创网通信售后回租项目\",\"现金流入金额\":\"117.67\",\"合同总金额\":\"2000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0063)号\",\"现金流入时间\":1694448000000}],\"现金流出时间\":1694880000000},{\"融资金额\":\"7560.00\",\"融资编码\":\"DK202304140021-17\",\"现金流出金额\":\"3.23\",\"融资渠道\":\"中国民生银行股份有限公司杭州分行\",\"资产端列表\":[{\"项目名称\":\"2022四川创网通信售后回租项目\",\"现金流入金额\":\"117.67\",\"合同总金额\":\"2000.00\",\"合同编号\":\"浙商租【2022】租字第(A-0063)号\",\"现金流入时间\":1694448000000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2100.00\",\"融资编码\":\"DK202304120004-08\",\"现金流出金额\":\"5.64\",\"融资渠道\":\"恒丰银行杭州分行营业部\",\"资产端列表\":[{\"项目名称\":\"湖南力天汽车回租项目\",\"现金流入金额\":\"110.49\",\"合同总金额\":\"2500.00\",\"合同编号\":\"浙商租【2023】租字第(A-0105)号\",\"现金流入时间\":1695916800000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"2750.00\",\"融资编码\":\"DK202304140022-27\",\"现金流出金额\":\"6.85\",\"融资渠道\":\"中信银行杭州萧山支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"7300.00\",\"融资编码\":\"DK202304110001-10\",\"现金流出金额\":\"93.28\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"天铁热轧板有限公司售后回租项目\",\"现金流入金额\":\"127.78\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0068)号\",\"现金流入时间\":1694102400000}],\"现金流出时间\":1694102400000},{\"融资金额\":\"7300.00\",\"融资编码\":\"DK202304110001-10\",\"现金流出金额\":\"16.26\",\"融资渠道\":\"中国光大银行股份有限公司杭州浙大支行\",\"资产端列表\":[{\"项目名称\":\"天铁热轧板有限公司售后回租项目\",\"现金流入金额\":\"127.78\",\"合同总金额\":\"10000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0068)号\",\"现金流入时间\":1694102400000}],\"现金流出时间\":1695225600000},{\"融资金额\":\"14700.00\",\"融资编码\":\"DK202304140030-02\",\"现金流出金额\":\"943.68\",\"融资渠道\":\"中国银行股份有限公司杭州钱江新城支行\",\"资产端列表\":[],\"现金流出时间\":1695225600000},{\"融资金额\":\"3400.00\",\"融资编码\":\"DK202304140031-26\",\"现金流出金额\":\"3407.17\",\"融资渠道\":\"浙商银行股份有限公司杭州分行营业部\",\"资产端列表\":[],\"现金流出时间\":1695830400000},{\"融资金额\":\"2500.00\",\"融资编码\":\"DK202304140031-27\",\"现金流出金额\":\"104.14\",\"融资渠道\":\"上海浦东发展银行股份有限公司杭州德胜支行\",\"资产端列表\":[{\"项目名称\":\"江苏太一光伏科技有限公司融资租赁项目\",\"现金流入金额\":\"131.61\",\"合同总金额\":\"3000.00\",\"合同编号\":\"浙商租【2023】租字第(A-0091)号\",\"现金流入时间\":1695312000000}],\"现金流出时间\":1695312000000}]";
        List<Record> result = JSONUtil.toBean(s, new TypeReference<List<Record>>() {
        }, true);
        writeToExcel(result);
    }

    private static void writeToExcel(List<Record> result) {
        result.sort(Comparator.comparing(Record::get融资渠道));
        ExcelWriter writer = ExcelUtil.getWriter(Paths.get(
                        System.getProperty("user.home"),
                        "Desktop",
                        monthStart.getMonthValue() + "月资金流动性统计表.xlsx")
                .toFile());
        //写头部
        writer.merge(0, 0, 0, 4, "资金端", true);
        writer.merge(0, 1, 5, 5, "金额不足", true);
        writer.merge(0, 1, 6, 6, "日期错配", true);
        writer.merge(0, 0, 7, 11, "资产端", true);
        writer.writeCellValue(0, 1, "融资渠道");
        writer.writeCellValue(1, 1, "融资编码");
        writer.writeCellValue(2, 1, "融资金额（万元）");
        writer.writeCellValue(3, 1, "现金流出时间");
        writer.writeCellValue(4, 1, "现金流出金额（万元）");
        writer.writeCellValue(7, 1, "项目名称");
        writer.writeCellValue(8, 1, "合同编号");
        writer.writeCellValue(9, 1, "合同总金额（万元）");
        writer.writeCellValue(10, 1, "现金流入时间");
        writer.writeCellValue(11, 1, "现金流入金额（万元）");
        //写行数据
        writer.setCurrentRow(2);
        Set<String> already = new HashSet<>();
        for (Record record : result) {
            boolean codeExists = already.contains(record.get融资编码());
            already.add(record.get融资编码());
            int startRow = writer.getCurrentRow();
            List<InRecord> 资产端列表 = record.get资产端列表();
            if (资产端列表.isEmpty()) {
                writer.writeRow(ListUtil.of(
                        record.get融资渠道(), record.get融资编码(), record.get融资金额(), record.get现金流出时间(), record.get现金流出金额(), "", "",
                        null, null, null, null, null
                ));
            }
            for (InRecord inRecord : 资产端列表) {
                writer.writeRow(ListUtil.of(
                        record.get融资渠道(), record.get融资编码(), record.get融资金额(), record.get现金流出时间(), record.get现金流出金额(), "", "",
                        inRecord.get项目名称(), inRecord.get合同编号(), inRecord.get合同总金额(), inRecord.get现金流入时间(), inRecord.get现金流入金额()
                ));
                //着色
                if (codeExists) {
                    for (int i = 7; i <= 11; i++) {
                        CellStyle style = writer.createCellStyle(i, writer.getCurrentRow() - 1);
                        style.setFillForegroundColor(IndexedColors.YELLOW.getIndex());
                        style.setFillPattern(FillPatternType.SOLID_FOREGROUND);
                        writer.setStyle(style, i, startRow);
                        if (i == 7) {
                            addCellComment(writer.getCell(i, startRow), "该资产已有其他现金流关联", true);
                        }
                    }
                }
            }


            //合并行
            int endRow = writer.getCurrentRow() - 1;
            if (资产端列表.size() > 1) {
                writer.merge(startRow, endRow, 0, 0, record.get融资渠道(), false);
                writer.merge(startRow, endRow, 1, 1, record.get融资编码(), false);
                writer.merge(startRow, endRow, 2, 2, record.get融资金额(), false);
                writer.merge(startRow, endRow, 3, 3, record.get现金流出时间(), false);
                writer.merge(startRow, endRow, 4, 4, record.get现金流出金额(), false);
            }
            //金额不足
            double inTotal = 资产端列表.stream().mapToDouble(e -> parseDouble(e.get现金流入金额())).sum();
            String text = inTotal < parseDouble(record.get现金流出金额()) ? "Y" : "";
            writer.writeCellValue(5, startRow, text);
            if (StrUtil.isNotBlank(text)) {
                CellStyle style = writer.createCellStyle(5, startRow);
                style.setFillForegroundColor(IndexedColors.RED.getIndex());
                style.setFillPattern(FillPatternType.SOLID_FOREGROUND);
                writer.setStyle(style, 5, startRow);
            }
            if (资产端列表.size() > 1) {
                writer.merge(startRow, endRow, 5, 5, text, false);
            }
            //日期错配
            double beforeInTotal = 资产端列表.stream().filter(e -> !e.get现金流入时间().isAfter(record.get现金流出时间()))
                    .mapToDouble(e -> parseDouble(e.get现金流入金额())).sum();
            text = /*总资金足够*/inTotal >= parseDouble(record.get现金流出金额())
                    &&
                    /*日期过滤后不足*/beforeInTotal < parseDouble(record.get现金流出金额()) ? "Y" : "";
            writer.writeCellValue(6, startRow, text);
            if (StrUtil.isNotBlank(text)) {
                CellStyle style = writer.createCellStyle(6, startRow);
                style.setFillForegroundColor(IndexedColors.RED.getIndex());
                style.setFillPattern(FillPatternType.SOLID_FOREGROUND);
                writer.setStyle(style, 6, startRow);
            }
            if (资产端列表.size() > 1) {
                writer.merge(startRow, endRow, 6, 6, text, false);
            }

        }
        writer.close();
    }

    /**
     * 通过id获取合同信息
     *
     * @param id
     * @return
     */
    private ContractBaseInfo getContractBaseInfo(Long id) {
        if (contractBaseInfoMap.containsKey(id)) {
            return contractBaseInfoMap.get(id);
        }
        ContractBaseInfo baseInfo = getBean(ContractBaseInfoService.class).getById(id);
        contractBaseInfoMap.put(id, baseInfo);
        return contractBaseInfoMap.get(id);
    }

    /**
     * 通过还本付息id获取信息
     *
     * @param id
     * @return
     */
    private FundReceiptRepayBaseInfo getFundReceiptInfo(Long id) {
        if (fundReceiptRepayBaseInfoMap.containsKey(id)) {
            return fundReceiptRepayBaseInfoMap.get(id);
        }
        FundReceiptRepayBaseInfo baseInfo = getBean(FundReceiptRepayBaseInfoService.class).getById(id);
        fundReceiptRepayBaseInfoMap.put(id, baseInfo);
        return fundReceiptRepayBaseInfoMap.get(id);
    }

    /**
     * 根据融资id获取融资信息
     *
     * @param id
     * @return
     */

    private FundFinancingBaseInfo getFundFinancingInfo(Long id) {
        if (fundFinnancingRepayBaseInfoMap.containsKey(id)) {
            return fundFinnancingRepayBaseInfoMap.get(id);
        }
        FundFinancingBaseInfo baseInfo = getBean(FundFinancingBaseInfoService.class).getById(id);
        fundFinnancingRepayBaseInfoMap.put(id, baseInfo);
        return fundFinnancingRepayBaseInfoMap.get(id);

    }


    public static void addCellComment(Cell cell, String value, boolean isXlsx) {
        Sheet sheet = cell.getSheet();
        cell.removeCellComment();
        Drawing drawing = sheet.createDrawingPatriarch();
        Comment comment;
        if (isXlsx) {
            // 创建批注
            comment = drawing.createCellComment(new XSSFClientAnchor(1, 1, 1, 1, 1, 1, 1, 1));
            // 输入批注信息
            comment.setString(new XSSFRichTextString(value));
            // 将批注添加到单元格对象中
        } else {
            // 创建批注
            comment = drawing.createCellComment(new HSSFClientAnchor(1, 1, 1, 1, (short) 1, 1, (short) 1, 1));
            // 输入批注信息
            comment.setString(new HSSFRichTextString(value));
            // 将批注添加到单元格对象中
        }
        cell.setCellComment(comment);
    }

    public static String toWanYuan(Long dbNumber) {
        if (Objects.isNull(dbNumber)) {
            return null;
        }
        BigDecimal bigDecimal = NumberUtil.div(dbNumber.toString(), String.valueOf(Long.parseLong(GlobalConstants.MONEY_MULTIPLE)));
        return bigDecimal.divide(BigDecimal.valueOf(10000L), 2, RoundingMode.HALF_UP).toPlainString();
    }

    Map<Long, ContractBaseInfo> contractBaseInfoMap = new HashMap<>();
    Map<Long, FundReceiptRepayBaseInfo> fundReceiptRepayBaseInfoMap = new HashMap<>();
    Map<Long, FundFinancingBaseInfo> fundFinnancingRepayBaseInfoMap = new HashMap<>();

    @Data
    public static class Record {
        private String 融资渠道;
        private String 融资编码;
        private String 融资金额;
        private LocalDate 现金流出时间;
        private String 现金流出金额;
        private List<InRecord> 资产端列表 = new ArrayList<>();
    }

    @Accessors(chain = true)
    @Data
    public static class InRecord {
        private String 项目名称;
        private String 合同编号;
        private String 合同总金额;
        private LocalDate 现金流入时间;
        private String 现金流入金额;

    }
}
